# <font color=steelblue>DataFrame</font>

In [1]:
import numpy as np
import pandas as pd

In [2]:
import webbrowser
link = 'https://www.tiobe.com/tiob-index'
webbrowser.open(link)
df = pd.read_clipboard()
df

   Apr 2020  Apr 2019  Change Programming Language Ratings Change.1
0         1         1     NaN                 Java  16.73%   +1.69%
1         2         2     NaN                    C  16.72%   +2.64%
2         3         4  change               Python   9.31%   +1.15%
3         4         3  change                  C++   6.78%   -2.06%
4         5         6  change                   C#   4.74%   +1.23%

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df.columns

Index(['Apr 2020', 'Apr 2019', 'Change', 'Programming Language', 'Ratings',
       'Change.1'],
      dtype='object')

In [5]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
df.values

array([[1, 1, nan, 'Java', '16.73%', '+1.69%'],
       [2, 2, nan, 'C', '16.72%', '+2.64%'],
       [3, 4, 'change', 'Python', '9.31%', '+1.15%'],
       [4, 3, 'change', 'C++', '6.78%', '-2.06%'],
       [5, 6, 'change', 'C#', '4.74%', '+1.23%']], dtype=object)

In [7]:
type(df.Ratings)

pandas.core.series.Series

In [8]:
df_new = pd.DataFrame(df,columns=['Programming Language'
                                  ,'Apr 2019','Apr 2021'])
df_new

  Programming Language  Apr 2019  Apr 2021
0                 Java         1       NaN
1                    C         2       NaN
2               Python         4       NaN
3                  C++         3       NaN
4                   C#         6       NaN

In [9]:
df_new['Apr 2021'] = np.arange(0,5)
df_new

  Programming Language  Apr 2019  Apr 2021
0                 Java         1         0
1                    C         2         1
2               Python         4         2
3                  C++         3         3
4                   C#         6         4

In [10]:
df_new['Apr 2021'] = pd.Series([100,200],index=[1,2])
df_new

  Programming Language  Apr 2019  Apr 2021
0                 Java         1       NaN
1                    C         2     100.0
2               Python         4     200.0
3                  C++         3       NaN
4                   C#         6       NaN

# <font color=steelblue>DataFrame与Series</font>

In [11]:
data = {'Country':['Belgium','India','Brazil'],
        'Capital':['Brussels','New Delhi','Brasilis'],
        'Population':[11190846,1303171035,207847528]}

In [12]:
df1 = pd.DataFrame(data)
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilis   207847528

In [13]:
column = df1.Country
print(type(column),'\n',column)

<class 'pandas.core.series.Series'>
 0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [14]:
row = next(df1.iterrows())
print('——————————————')
print(type(row),'\n',row)
print('--------------')
print(type(row[0]),'\n',row[0])
print('--------------')
print(type(row[1]),'\n',row[1])
print('——————————————')

——————————————
<class 'tuple'>
 (0, Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object)
--------------
<class 'int'>
 0
--------------
<class 'pandas.core.series.Series'>
 Country        Belgium
Capital       Brussels
Population    11190846
Name: 0, dtype: object
——————————————

In [15]:
s1 = df1.Capital
s2 = df1.Country
s3 = df1.Population
df1_new = pd.DataFrame([s1,s2,s3],index=['Capital','Country','Population'])
df1_new

                   0           1          2
Capital     Brussels   New Delhi   Brasilis
Country      Belgium       India     Brazil
Population  11190846  1303171035  207847528

In [16]:
df1_new.T

     Capital  Country  Population
0   Brussels  Belgium    11190846
1  New Delhi    India  1303171035
2   Brasilis   Brazil   207847528

# <font color=steelblue>Dataframe的IO</font>

In [1]:
import numpy as np
import pandas as pd

In [17]:
import webbrowser
link = 'http://pandas.pydata.org/pandas-docs/version/0.20/io.html'
webbrowser.open(link)
df2 = pd.read_clipboard()
df2.to_clipboard()
df2

   Format Type      Data Description          Reader        Writer
0         text                   CSV        read_csv        to_csv
1         text                  JSON       read_json       to_json
2         text                  HTML       read_html       to_html
3         text       Local clipboard  read_clipboard  to_clipboard
4       binary              MS Excel      read_excel      to_excel
5       binary           HDF5 Format        read_hdf        to_hdf
6       binary        Feather Format    read_feather    to_feather
7       binary               Msgpack    read_msgpack    to_msgpack
8       binary                 Stata      read_stata      to_stata
9       binary                   SAS        read_sas
10      binary  Python Pickle Format     read_pickle     to_pickle
11         SQL                   SQL        read_sql        to_sql
12         SQL      Google Big Query        read_gbq        to_gbq

In [18]:
df2.to_csv('df2.csv')
!ls

DataFrame_1.ipynb Series.ipynb      df1.csv           df2.csv

In [ ]:
!more df2.csv

,Format Type,Data Description,Reader,Writer
0,text,CSV,read_csv,to_csv
1,text,JSON,read_json,to_json
2,text,HTML,read_html,to_html
3,text,Local clipboard,read_clipboard,to_clipboard
4,binary,MS Excel,read_excel,to_excel
5,binary,HDF5 Format,read_hdf,to_hdf
6,binary,Feather Format,read_feather,to_feather
7,binary,Msgpack,read_msgpack,to_msgpack
8,binary,Stata,read_stata,to_stata
9,binary,SAS,read_sas,
10,binary,Python Pickle Format,read_pickle,to_pickle
11,SQL,SQL,read_sql,to_sql
12,SQL,Google Big Query,read_gbq,to_gbq
df2.csv (END)

***
<font size=10>······</font>